---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetDeformedShapeSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
source: html/9da27661-c81e-0343-cca3-2ae3a8e90f41.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetDeformedShapeSettings Method

Set deformed shape settings object for the style.

## Syntax (C#)
```csharp
public void SetDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings deformedShapeSettings
)
```

## Parameters
- **deformedShapeSettings** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Deformed shape settings were not created with the object.